src/config/Catalogs/Пароли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Пароли</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОбъектовПаролей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/InformationRegisters/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Добавлен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Статья</v8:Type>
						<v8:Type>cfg:CatalogRef.Пароли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Catalogs/Пароли/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНаборФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого Стр Из Объект.Данные Цикл
		Стр.ПарольБезШифрования = ПолучитьПарольДляСтрокиНаСервере(Объект.Данные.Индекс(стр));
	КонецЦикла;
	
	Элементы.ДанныеПарольБезШифрования.РежимПароля = Истина;
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаПаролей = ТекущийОбъект.Данные.Выгрузить();
	
	Для каждого Стр Из ТаблицаПаролей Цикл
		Стр.Пароль = МодульКриптографииСервер.ПолучитьЗашифрованныеДанные(Объект.Данные[ТаблицаПаролей.Индекс(стр)].ПарольБезШифрования, ПараметрыСеанса.МастерПароль);
		Если Не ЗначениеЗаполнено(Стр.ID) Тогда
			Стр.ID = Новый УникальныйИдентификатор();
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Для каждого Стр Из Объект.Данные Цикл
		Стр.ПарольБезШифрования = ПолучитьПарольДляСтрокиНаСервере(Объект.Данные.Индекс(стр));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере (МассивПриложений, Скрытый)
	РегистрыСведений.Файлы.ЗаписатьФайлы(МассивПриложений, Объект.Ссылка, Скрытый);
КонецПроцедуры

#КонецОбласти


&НаСервере
Функция ПолучитьПарольДляСтрокиНаСервере(Индекс)
	
	Об = РеквизитФормыВЗначение("Объект");
	Результат = МодульКриптографииСервер.ПолучитьРасшифрованныеДанные(Об.Данные[Индекс].Пароль, ПараметрыСеанса.МастерПароль);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВклВыклРежимПароля(Команда)
	
	Элементы.ДанныеПарольБезШифрования.РежимПароля = Не Элементы.ДанныеПарольБезШифрования.РежимПароля;
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	// Костыль. Работает. Не знаю почему
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ВклВыклРежимРедактирования(Команда)
	ЭтаФорма.ТолькоПросмотр = Не ЭтаФорма.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьЛогин(Команда)
	
	COMОбъект = Новый COMОбъект("htmlfile"); 
	COMОбъект.ParentWindow.ClipboardData.Setdata("Text", Элементы.Данные.ТекущиеДанные.Логин); 
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПароль(Команда)
	
	COMОбъект = Новый COMОбъект("htmlfile"); 
	COMОбъект.ParentWindow.ClipboardData.Setdata("Text", Элементы.Данные.ТекущиеДанные.ПарольБезШифрования); 
	
КонецПроцедуры


#Область Вложения

&НаКлиенте
Процедура ПриложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина; // Аналог стандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресВХранилище = "";
		ВыбранноеИмяФайла = "";
		Если ПоместитьФайл(АдресВХранилище, , ВыбранноеИмяФайла, Истина, ЭтаФорма.УникальныйИдентификатор) Тогда
			ЗаписатьПриложениеНаСервере(ВыбранноеИмяФайла, АдресВХранилище);
		КонецЕсли;
		ПрочитатьНаборФайлов();
	Иначе
		Предупреждение("Перед добавлением необходимо записать элемент.");
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияПослеУдаления(Элемент)
	
	ЗаписатьНаборФайлов();
	ПрочитатьНаборФайлов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресВХранилище = "";
	ПрочитатьПриложениеНаСервере(ВыбраннаяСтрока,АдресВХранилище);
    ПолучитьФайл(АдресВХранилище,НаборЗаписей[ВыбраннаяСтрока].ИмяФайла,Истина);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборФайлов()
	
	Набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей();
	
	Набор.Отбор.Документ.ВидСравнения = ВидСравнения.Равно;
	Набор.Отбор.Документ.Значение = Объект.Ссылка;
	Набор.Отбор.Документ.Использование = Истина;
	
	Набор.Отбор.Скрытый.ВидСравнения = ВидСравнения.Равно;
	Набор.Отбор.Скрытый.Значение = Ложь;
	Набор.Отбор.Скрытый.Использование = Истина;
	
	Набор.Прочитать(); 
	
	ЗначениеВДанныеФормы(Набор,НаборЗаписей);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборФайлов()
	
	Набор = РеквизитФормыВЗначение("НаборЗаписей");
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьВсеПриложенияНаСервере(УИД)
		
	Струк = РегистрыСведений.Файлы.ПрочитатьФайлы(УИД, Объект.Ссылка);
	Возврат Струк
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьВсеПриложения()
	
	КаталогФайлов = КаталогВременныхФайлов() + "МенеджерБТИ\";
	
	СоздатьКаталог(КаталогФайлов);
	
	ОбщаяСтруктура = ПрочитатьВсеПриложенияНаСервере(ЭтаФорма.УникальныйИдентификатор); 
	
	МасПрикрепленныеКартинки = ОбщаяСтруктура.ПрикрепленныеКартинки;
	Если МасПрикрепленныеКартинки.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из МасПрикрепленныеКартинки Цикл
			ТекСтрока.Имя = КаталогФайлов + ТекСтрока.Имя;
		КонецЦикла;
		ПолучитьФайлы(МасПрикрепленныеКартинки,,,Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПриложениеНаСервере(ВыбранноеИмяФайла, АдресВХранилище)
	
	РегистрыСведений.Файлы.ЗаписатьФайл(ВыбранноеИмяФайла, Объект.Ссылка, АдресВХранилище);
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьПриложениеНаСервере(ВыбраннаяСтрока, Адрес)
	
	МЗ = РегистрыСведений.Файлы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, НаборЗаписей[ВыбраннаяСтрока]);
	МЗ.Прочитать();
	
	Струк = Новый Структура("ИмяФайла, Документ", МЗ.ИмяФайла, Мз.Документ);
	
	Адрес = РегистрыСведений.Файлы.ПрочитатьФайл(Струк, ЭтаФорма.УникальныйИдентификатор); 
	
КонецПроцедуры

#КонецОбласти
